
[
  {
    "company": "Tromb",
    "role": "Fullstack Developer, Trainee",
    "period": "2025 - Present",
    "description": "Developed a React-based PDF generator for dynamically creating and formatting consultant resumes, collaborating with a designer on strict formatting. Built a UI for data editing with caching. Integrated with an existing HR system using Entra ID (MSAL) authentication.",
    "achievements": [
      "Developed new .NET backend API endpoints and managed database operations (queries, migrations) in production",
      "Utilized agile TDD and CI/CD pipelines in Azure with Docker",
      "Integrated React-pdf for dynamic PDF generation with strict formatting requirements"
    ],
    "projects": [
      {
        "slug": "consultantresume",
        "name": "ConsultantResume",
        "description": "React-based PDF generator for dynamically creating consultant resumes",
        "icon": "description"
      }
    ]
  },
  {
    "company": "AlgoSkin",
    "role": "Developer",
    "period": "2022 - Present",
    "description": "Designed, developed, and currently operating a profitable algorithmic arbitrage trading system with Node.js and TypeScript. Integration with external APIs, data scraping, local data storage, currency conversions and complex algorithmic price calculations.",
    "achievements": [
      "Built profitable algorithmic arbitrage trading system with high uptime",
      "Implemented extensive error handling to ensure system reliability",
      "Operation and maintenance in secure Linux environment with virtualization and VPN tunnels"
    ],
    "projects": [
      {
        "slug": "algoskin",
        "name": "AlgoSkin",
        "description": "Algorithmic arbitrage trading system with Node.js and TypeScript",
        "icon": "trending_up"
      }
    ]
  },
  {
    "company": "School Group Projects",
    "role": "Developer",
    "period": "2024 - 2025",
    "description": "Developed various full-stack applications as part of educational curriculum, focusing on modern web technologies and agile development practices.",
    "achievements": [
      "Applied TDD and agile methodologies in team environments",
      "Built comprehensive learning management system with user authentication",
      "Developed optimization algorithms for real-world problem solving"
    ],
    "projects": [
      {
        "slug": "lms",
        "name": "LMS",
        "description": "Learning Management System built as school group project",
        "icon": "school"
      },
      {
        "slug": "groceryoptimizer",
        "name": "GroceryOptimizer",
        "description": "Optimization system for grocery shopping built as school group project",
        "icon": "shopping_cart"
      }
    ]
  }
]
